Gemmus/PSoC/Project-DAQ_for_RaspberryPi/Project-DAQ_for_RaspberryPi.cydsn/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "ADC_DelSig.h"
#include "AMux.h"
#include "Potentiometer_Pin23_aliases.h"
#include "Potentiometer_Pin23.h"
#include "LM35_Pin24_aliases.h"
#include "LM35_Pin24.h"
#include "Pin25_aliases.h"
#include "Pin25.h"
#include "Pin26_aliases.h"
#include "Pin26.h"
#include "ADC_Clock.h"
#include "ADC_ISR.h"
#include "DEBUG_UART.h"
#include "SDA_aliases.h"
#include "SDA.h"
#include "SCL_aliases.h"
#include "SCL.h"
#include "I2C_Clock.h"
#include "RST_aliases.h"
#include "RST.h"
#include "I2C.h"
#include "I2C_PVT.h"
#include "ADC_DelSig_AMux.h"
#include "ADC_DelSig_Ext_CP_Clk.h"
#include "ADC_DelSig_IRQ.h"
#include "DEBUG_UART_IntClock.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

